## Pandas 5
### Membalik urutan baris dan kolom pada data frame

#### Import modules

In [51]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__) # Melakukan printing version

1.1.3
1.19.2

#### Persiapan Data Frame

In [52]:
n_rows = 5 # ukuran baris
n_cols = 5 # ukuran kolom
cols = tuple("ABCDE") # label untuk kolom
df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
# membuat data frame menggunakan bilangan random dari 1 sampai 9, dengan ukuran 5x5.
df

   A  B  C  D  E
0  2  4  9  4  9
1  9  9  3  7  9
2  8  8  3  9  7
3  8  3  9  4  3
4  3  5  7  7  7

#### Membalik urutan kolom

In [53]:
df.loc[:,::-1] # Membalik urutan kolom, tidak hanya membalik label pada kolom tapi juga isi dari setiap label.

   E  D  C  B  A
0  9  4  9  4  2
1  9  7  3  9  9
2  7  9  3  8  8
3  3  4  9  3  8
4  7  7  7  5  3

#### Membalik urutan baris

In [54]:
df.loc[::-1] # Membalik urutan baris, tidak hanya membalik index dari setiap index tapi juga isi dari setiap baris.

   A  B  C  D  E
4  3  5  7  7  7
3  8  3  9  4  3
2  8  8  3  9  7
1  9  9  3  7  9
0  2  4  9  4  9

#### Membalik urutan baris dan melakukan penyesuaian ulang index

In [55]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  3  5  7  7  7
1  8  3  9  4  3
2  8  8  3  9  7
3  9  9  3  7  9
4  2  4  9  4  9

## Pandas 6
### Mengganti nama (label) kolom pada Data Frame

#### Persiapan Data Frame

In [56]:
n_rows2 = 5 # ukuran baris
n_cols2 = 5 # ukuran kolom
cols2 = tuple("ABCDE") # label untuk kolom
df2 = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
# membuat data frame menggunakan bilangan random dari 1 sampai 9, dengan ukuran 5x5.
df2

   A  B  C  D  E
0  2  8  3  8  5
1  1  2  4  2  4
2  9  3  2  6  2
3  7  1  3  6  9
4  9  7  6  7  9

#### Mengganti nama (label) untuk sebuah kolom pada Data Frame.

In [57]:
df2.rename(columns={'C':'Hobi'}) # Mengganti 1 label kolom.

   A  B  Hobi  D  E
0  2  8     3  8  5
1  1  2     4  2  4
2  9  3     2  6  2
3  7  1     3  6  9
4  9  7     6  7  9

In [58]:
df2.rename(columns={'C':'Hobi','A':'Nama','B':'Alamat'}) # Mengganti lebih dari 1 label kolom.

   Nama  Alamat  Hobi  D  E
0     2       8     3  8  5
1     1       2     4  2  4
2     9       3     2  6  2
3     7       1     3  6  9
4     9       7     6  7  9

## Pandas 7
### Menghapus missing value

In [59]:
df3 = pd.util.testing.makeMissingDataframe().reset_index() # Membuat data frame dummy yang berisi NaN value didalamnya.
df3.head() # hanya menampilkan data pada 5 index pertama

        index         A         B         C         D
0  B7gFPEH1y6       NaN  1.158128  0.433221 -0.821744
1  CKhIVppkZ5 -2.012960 -0.568942 -0.304272       NaN
2  nnC9JGXryY -0.184580 -0.399827 -0.187001  0.731966
3  Ov42WasgLZ -1.843463  1.243171 -2.145872 -0.477540
4  tH5n12cj1S -0.900071  0.568499 -1.547032 -0.847908

In [60]:
df3 = df3.rename(columns={'index':'Z'}) # Mengganti nama kolom index menjadi z
df3.head()

            Z         A         B         C         D
0  B7gFPEH1y6       NaN  1.158128  0.433221 -0.821744
1  CKhIVppkZ5 -2.012960 -0.568942 -0.304272       NaN
2  nnC9JGXryY -0.184580 -0.399827 -0.187001  0.731966
3  Ov42WasgLZ -1.843463  1.243171 -2.145872 -0.477540
4  tH5n12cj1S -0.900071  0.568499 -1.547032 -0.847908

In [61]:
df3_backup = df3.copy(deep=True) # Melakukan copy sebuah data frame
df3_backup.head()

            Z         A         B         C         D
0  B7gFPEH1y6       NaN  1.158128  0.433221 -0.821744
1  CKhIVppkZ5 -2.012960 -0.568942 -0.304272       NaN
2  nnC9JGXryY -0.184580 -0.399827 -0.187001  0.731966
3  Ov42WasgLZ -1.843463  1.243171 -2.145872 -0.477540
4  tH5n12cj1S -0.900071  0.568499 -1.547032 -0.847908

#### Menghapus setiap kolom yang mengandung missing values

In [62]:
df3 = df3.dropna(axis='columns') # menghapus kolom yang terdapat missing value menggunakan method dropna
df3.head()

            Z
0  B7gFPEH1y6
1  CKhIVppkZ5
2  nnC9JGXryY
3  Ov42WasgLZ
4  tH5n12cj1S

#### Menghapus setiap baris yang mengandung missing values

In [63]:
df3 = df3_backup.copy(deep=True)
df3 = df3.dropna(axis='rows') # menghapus baris yang terdapat missing value menggunakan method dropna
df3.head()

            Z         A         B         C         D
2  nnC9JGXryY -0.184580 -0.399827 -0.187001  0.731966
3  Ov42WasgLZ -1.843463  1.243171 -2.145872 -0.477540
4  tH5n12cj1S -0.900071  0.568499 -1.547032 -0.847908
5  RZwanVcyOb  0.238385 -0.061057  0.112629  0.992679
6  w8xf6leQW6 -0.564312 -0.320171  0.230737  0.420109

#### Persentase missing values untuk tiap kolom

In [64]:
df3 = df3_backup.copy(deep=True)
df3.isna().mean() # isna digunakan untuk mencari semua baris yang memiliki missing values.

Z    0.000000
A    0.066667
B    0.100000
C    0.133333
D    0.100000
dtype: float64

#### Menghapus setiap kolom yang mengandung missing values berdasarkan threshold atau ambang batas tertentu.

In [65]:
treshold = len(df3) * 0.9 # Menentukan ambang batas, kolom yang akan dihapus adalah kolom yang 90% datanya bukan berupa missing value
df3 = df3.dropna(thresh=treshold, axis="columns") # Menghapus kolom yang tidak sesuai nilainya tidak sesuai dengan ambang batas yang ditentukan.
df3.head()

            Z         A         B         D
0  B7gFPEH1y6       NaN  1.158128 -0.821744
1  CKhIVppkZ5 -2.012960 -0.568942       NaN
2  nnC9JGXryY -0.184580 -0.399827  0.731966
3  Ov42WasgLZ -1.843463  1.243171 -0.477540
4  tH5n12cj1S -0.900071  0.568499 -0.847908

## Pandas 8
### Memeriksa kesamaan antar dua buah kolom pada data frame.

#### Persiapan Data Frame

In [66]:
data = {'A':[15,15,18,np.nan,12],
        'B':[15,15,18,np.nan,12]} # Membuat sebuah data frame dengan 2 kolom yang memiliki data sama.
df4 = pd.DataFrame(data)
df4

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

#### Mengenal Pandas Series

In [67]:
df4['A'] # pandas series indexing pada pandas data frame.

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [68]:
type(df4['A']) # tipe data series pada setiap kolom.

pandas.core.series.Series

In [69]:
type(df4)

pandas.core.frame.DataFrame

#### Memeriksa kesamaan dengan menggunakan operator ==

In [75]:
"""Membandingkan kedua boleh setiap data yang dimiliki kedua buah kolom.
Operator == tidak bisa membandingkan data yang bernilai NaN.
"""
df4['A'] == df4['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

#### Memeriksa kesamaan dengan method equals()

In [76]:
df4['A'].equals(df4['B'])

True

#### Memeriksa kesamaan antar dua data frame

In [80]:
df4_backup = df4.copy(deep=True)
df4.equals(df4) # Jika ingin membandingkan kesamaan antara 2 buah data frame ataupun kolom lebih baik menggunakan method equal.

True

In [81]:
df4 == df4_backup

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True